<a href="https://colab.research.google.com/github/PawanLode/ineuron-Test/blob/main/Data_cleaningipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [92]:
import pandas as pd
import numpy as np

In [93]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [94]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [95]:
df['FlightNumber']=df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [96]:
df['Source']=df['From_To'].str.split('_').str[0].str.capitalize()
df

            From_To  FlightNumber  RecentDelays              Airline    Source
0      LoNDon_paris         10045      [23, 47]               KLM(!)    London
1      MAdrid_miLAN         10055            []    <Air France> (12)    Madrid
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )    London
3    Budapest_PaRis         10075          [13]       12. Air France  Budapest
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"  Brussels

In [97]:
df['Destination']=df['From_To'].str.split('_').str[1].str.capitalize()
df

            From_To  FlightNumber  ...    Source Destination
0      LoNDon_paris         10045  ...    London       Paris
1      MAdrid_miLAN         10055  ...    Madrid       Milan
2  londON_StockhOlm         10065  ...    London   Stockholm
3    Budapest_PaRis         10075  ...  Budapest       Paris
4   Brussels_londOn         10085  ...  Brussels      London

[5 rows x 6 columns]

In [98]:
df.drop('From_To',axis=1,inplace=True)

In [99]:
df
pd.DataFrame(df['RecentDelays'].tolist(),columns=['delay_1','delay_2','delay_3'])

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [104]:
obj=pd.DataFrame(df['RecentDelays'].tolist(),columns=['delay_1','delay_2','delay_3'])
df.drop('RecentDelays',axis=1,inplace=True)
df.insert(2,'delay_1',obj['delay_1'])
df.insert(3,'delay_2',obj['delay_2'])
df.insert(4,'delay_3',obj['delay_3'])

In [105]:
df

   FlightNumber              Airline  delay_1  ...  delay_3    Source Destination
0         10045               KLM(!)     23.0  ...      NaN    London       Paris
1         10055    <Air France> (12)      NaN  ...      NaN    Madrid       Milan
2         10065  (British Airways. )     24.0  ...     87.0    London   Stockholm
3         10075       12. Air France     13.0  ...      NaN  Budapest       Paris
4         10085          "Swiss Air"     67.0  ...      NaN  Brussels      London

[5 rows x 7 columns]